# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'svn'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'kubectl'
brew 'helm'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'telnet'
brew 'wrk'

# Apps
cask 'alfred'
cask 'blackhole'
cask 'caprine'
cask 'camo-studio'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'android-studio'
cask 'android-platform-tools'
cask 'android-sdk'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'handbrake'
cask 'imageoptim'
cask 'iterm2'
cask 'firefox'
cask 'flux'
cask 'java'
cask 'little-snitch'
cask 'slack'
cask 'stats'
cask 'stremio'
cask 'sublime-text'
cask 'tableplus'
cask 'the-unarchiver'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-ibm-plex'
cask 'font-montserrat'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'MainStage 3', id: 634159523
mas 'Dato', id: 1470584107
mas 'Moom', id: 419330170
mas 'Wake Up Time', id: 495945638
mas 'Logic Pro X', id: 634148309
mas 'Amphetamine', id: 937984704
mas 'Trello', id: 1278508951
